[
  "Seven QC Tools",
  "1.",
  "Also called: defect concentration diagram Description A check sheet is a structured, prepared form for collecting and analyzing data. This is a generic tool that can be adapted for a wide variety of purposes. When to Use a Check Sheet • When data can be observed and collected repeatedly by the same person or at the same location. • When collecting data on the frequency or patterns of events, problems, defects, defect location, defect causes, etc.",
  "• When collecting data from a production process. Check Sheet Procedure • Decide what event or problem will be observed. Develop operational definitions. • Decide when data will be collected and for how long. • Design the form. Set it up so that data can be recorded simply by making check marks or Xs or similar symbols and so that data do not have to be recopied for analysis. • Label all spaces on the form. • Test the check sheet for a short",
  "trial period to be sure it collects the appropriate data and is easy to use. • Each time the targeted event or problem occurs, record data on the check sheet. Check Sheet Example The figure below shows a check sheet used to collect data on telephone interruptions. The tick marks were added as data was collected over several weeks.",
  "2.",
  "Also Called: Cause-and-Effect Diagram, Ishikawa Diagram Variations: cause enumeration diagram, process fishbone, time-delay fishbone, CEDAC (cause-and-effect diagram with the addition of cards), desired-result fishbone, reverse fishbone diagram Description The fishbone diagram identifies many possible causes for an effect or problem. It can be used to structure a brainstorming session. It immediately sorts ideas into useful categories. When to",
  "Use a Fishbone Diagram • When identifying possible causes for a problem. • Especially when a team’s thinking tends to fall into ruts. Fishbone Diagram Procedure Materials needed: flipchart or whiteboard, marking pens • Agree on a problem statement (effect). Write it at the center right of the flipchart or whiteboard. Draw a box around it and draw a horizontal arrow running to it. • Brainstorm the major categories of causes of the problem. If this",
  "is difficult use generic headings: o Methods o Machines (equipment) o People (manpower) o Materials o Measurement o Environment • Write the categories of causes as branches from the main arrow. • Brainstorm all the possible causes of the problem. Ask: “Why does this happen?” As each idea is given, the facilitator writes it as a branch from the appropriate category. Causes can be written in several places if they relate to several categories. •",
  "Again ask “why does this happen?” about each cause. Write sub- causes branching off the causes. Continue to ask “Why?” and generate deeper levels of causes. Layers of branches indicate causal relationships. • When the group runs out of ideas, focus attention to places on the chart where ideas are few. Fishbone Diagram Example This fishbone diagram was drawn by a manufacturing team to try to understand the source of periodic iron contamination.",
  "The team used the six generic headings to prompt ideas. Layers of branches show thorough thinking about the causes of the problem. For example, under the heading “Machines,” the idea “materials of construction” shows four kinds of equipment and then several specific machine numbers. Note that some ideas appear in two different places. “Calibration” shows up under “Methods” as a factor in the analytical procedure, and also under “Measurement” as a",
  "cause of lab error. “Iron tools” can be considered a “Methods” problem when taking samples or a “Manpower” problem with maintenance personnel.",
  "3.",
  "Description The control chart is a graph used to study how a process changes over time. Data are plotted in time order. A control chart always has a central line for the average, an upper line for the upper control limit and a lower line for the lower control limit. These lines are determined from historical data. By comparing current data to these lines, you can draw conclusions about whether the process variation is consistent (in control) or",
  "is unpredictable (out of control, affected by special causes of variation). Control charts for variable data are used in pairs. The top chart monitors the average, or the centering of the distribution of data from the process. The bottom chart monitors the range, or the width of the distribution. If your data were shots in target practice, the average is where the shots are clustering, and the range is how tightly they are clustered. Control",
  "charts for attribute data are used singly. When to Use a Control Chart • When controlling ongoing processes by finding and correcting problems as they occur. • When predicting the expected range of outcomes from a process. • When determining whether a process is stable (in statistical control). • When analyzing patterns of process variation from special causes (non-routine events) or common causes (built into the process). • When determining",
  "whether your quality improvement project should aim to prevent specific problems or to make fundamental changes to the process. Template See a sample control chart and create your own with the control chart template (Excel, 973 KB).* Control Chart Basic Procedure • Choose the appropriate control chart for your data. • Determine the appropriate time period for collecting and plotting data. • Collect data, construct your chart and analyze the data.",
  "• Look for “out-of-control signals” on the control chart. When one is identified, mark it on the chart and investigate the cause. Document how you investigated, what you learned, the cause and how it was corrected. Out-of-control signals A single point outside the control limits. In Figure 1, point sixteen is above the UCL (upper control limit). Two out of three successive points are on the same side of the centerline and farther than 2 σ from",
  "it. In Figure 1, point 4 sends that signal. Four out of five successive points are on the same side of the centerline and farther than 1 σ from it. In Figure 1, point",
  "11",
  "A run of eight in a row are on the same side of the centerline. Or 10 out of 11, 12 out of 14 or 16 out of 20. In Figure 1, point 21 is eighth in a row above the centerline. Obvious consistent or persistent patterns that suggest something unusual about your data and your process. Figure 1 Control Chart: Out-of-Control Signals • Continue to plot data as they are generated. As each new data point is plotted, check for new out-of-control signals. o",
  "When you start a new control chart, the process may be out of control. If so, the control limits calculated from the first 20 points are conditional limits. When you have at least 20 sequential points from a period when the process is operating in control, recalculate control limits",
  "4.",
  "Description A frequency distribution shows how often each different value in a set of data occurs. A histogram is the most commonly used graph to show frequency distributions. It looks very much like a bar chart, but there are important differences between them. When to Use a Histogram • When the data are numerical. • When you want to see the shape of the data’s distribution, especially when determining whether the output of a process is",
  "distributed approximately normally. • When analyzing whether a process can meet the customer’s requirements. • When analyzing what the output from a supplier’s process looks like. • When seeing whether a process change has occurred from one time period to another. • When determining whether the outputs of two or more processes are different. • When you wish to communicate the distribution of data quickly and easily to others. Histogram",
  "Construction • Collect at least 50 consecutive data points from a process. • Use the histogram worksheet to set up the histogram. It will help you determine the number of bars, the range of numbers that go into each bar and the labels for the bar edges. After calculating W in step 2 of the worksheet, use your judgment to adjust it to a convenient number. For example, you might decide to round 0.9 to an even 1.0. The value for W must not have more",
  "decimal places than the numbers you will be graphing. • Draw x- and y-axes on graph paper. Mark and label the y-axis for counting data values. Mark and label the x-axis with the L values from the worksheet. The spaces between these numbers will be the bars of the histogram. Do not allow for spaces between bars. • For each data point, mark off one count above the appropriate bar with an X or by shading that portion of the bar. • Histogram Analysis",
  "• Before drawing any conclusions from your histogram, satisfy yourself that the process was operating normally during the time period being studied. If any unusual events affected the process during the time period of the histogram, your analysis of the histogram shape probably cannot be generalized to all time periods. o Analyze the meaning of your histogram’s shape.",
  "5.",
  "Also called: Pareto diagram, Pareto analysis Variations: weighted Pareto chart, comparative Pareto charts Description A Pareto chart is a bar graph. The lengths of the bars represent frequency or cost (time or money), and are arranged with longest bars on the left and the shortest to the right. In this way the chart visually depicts which situations are more significant. When to Use a Pareto Chart • When analyzing data about the frequency of",
  "problems or causes in a process. • When there are many problems or causes and you want to focus on the most significant. • When analyzing broad causes by looking at their specific components. • When communicating with others about your data. • Pareto Chart Procedure • Decide what categories you will use to group items. • Decide what measurement is appropriate. Common measurements are frequency, quantity, cost and time. • Decide what period of",
  "time the Pareto chart will cover: One work cycle? One full day? A week? • Collect the data, recording the category each time. (Or assemble data that already exist.) • Subtotal the measurements for each category. • Determine the appropriate scale for the measurements you have collected. The maximum value will be the largest subtotal from step 5. (If you will do optional steps 8 and 9 below, the maximum value will be the sum of all subtotals from",
  "step 5.) Mark the scale on the left side of the chart. • Construct and label bars for each category. Place the tallest at the far left, then the next tallest to its right and so on. If there are many categories with small measurements, they can be grouped as “other.” • Steps 8 and 9 are optional but are useful for analysis and communication. • Calculate the percentage for each category: the subtotal for that category divided by the total for all",
  "categories. Draw a right vertical axis and label it with percentages. Be sure the two scales match: For example, the left measurement that corresponds to one-half should be exactly opposite 50% on the right scale. • Calculate and draw cumulative sums: Add the subtotals for the first and second categories, and place a dot above the second bar indicating that sum. To that sum add the subtotal for the third category, and place a dot above the third",
  "bar for that new sum. Continue the process for all the bars. Connect the dots, starting at the top of the first bar. The last dot should reach 100 percent on the right scale. Pareto Chart Examples Example #1 shows how many customer complaints were received in each of five categories. Example #2 takes the largest category, “documents,” from Example #1, breaks it down into six categories of document-related complaints, and shows cumulative values.",
  "If all complaints cause equal distress to the customer, working on eliminating document-related complaints would have the most impact, and of those, working on quality certificates should be most fruitful.",
  "6.",
  "Also called: scatter plot, X–Y graph Description The scatter diagram graphs pairs of numerical data, with one variable on each axis, to look for a relationship between them. If the variables are correlated, the points will fall along a line or curve. The better the correlation, the tighter the points will hug the line. When to Use a Scatter Diagram • When you have paired numerical data. • When your dependent variable may have multiple values for",
  "each value of your independent variable. • When trying to determine whether the two variables are related, such as… o When trying to identify potential root causes of problems. o After brainstorming causes and effects using a fishbone diagram, to determine objectively whether a particular cause and effect are related. o When determining whether two effects that appear to be related both occur with the same cause. o When testing for",
  "autocorrelation before constructing a control chart. • Scatter Diagram Procedure • Collect pairs of data where a relationship is suspected. • Draw a graph with the independent variable on the horizontal axis and the dependent variable on the vertical axis. For each pair of data, put a dot or a symbol where the x-axis value intersects the y-axis value. (If two dots fall together, put them side by side, touching, so that you can see both.) • Look",
  "at the pattern of points to see if a relationship is obvious. If the data clearly form a line or a curve, you may stop. The variables are correlated. You may wish to use regression or correlation analysis now. Otherwise, complete steps 4 through 7. • Divide points on the graph into four quadrants. If there are X points on the graph, o Count X/2 points from top to bottom and draw a horizontal line. o Count X/2 points from left to right and draw a",
  "vertical line. o If number of points is odd, draw the line through the middle point. • Count the points in each quadrant. Do not count points on a line. • Add the diagonally opposite quadrants. Find the smaller sum and the total of points in all quadrants. A = points in upper left + points in lower right B = points in upper right + points in lower left Q = the smaller of A and B N = A + B • Look up the limit for N on the trend test table. o If Q",
  "is less than the limit, the two variables are related. o If Q is greater than or equal to the limit, the pattern could have occurred from random chance. Scatter Diagram Considerations • Here are some examples of situations in which might you use a scatter diagram: o Variable A is the temperature of a reaction after 15 minutes. Variable B measures the color of the product. You suspect higher temperature makes the product darker. Plot temperature",
  "and color on a scatter diagram. o Variable A is the number of employees trained on new software, and variable B is the number of calls to the computer help line. You suspect that more training reduces the number of calls. Plot number of people trained versus number of calls. o To test for autocorrelation of a measurement being monitored on a control chart, plot this pair of variables: Variable A is the measurement at a given time. Variable B is",
  "the same measurement, but at the previous time. If the scatter diagram shows correlation, do another diagram where variable B is the measurement two times previously. Keep increasing the separation between the two times until the scatter diagram shows no correlation. • Even if the scatter diagram shows a relationship, do not assume that one variable caused the other. Both may be influenced by a third variable. • When the data are plotted, the",
  "more the diagram resembles a straight line, the stronger the relationship. • If a line is not clear, statistics (N and Q) determine whether there is reasonable certainty that a relationship exists. If the statistics say that no relationship exists, the pattern could have occurred by random chance. • If the scatter diagram shows no relationship between the variables, consider whether the data might be stratified. • If the diagram shows no",
  "relationship, consider whether the independent (x-axis) variable has been varied widely. Sometimes a relationship is not apparent because the data don’t cover a wide enough range. • Think creatively about how to use scatter diagrams to discover a root cause. o Drawing a scatter diagram is the first step in looking for a relationship between variables.",
  "7.",
  "Description Stratification is a technique used in combination with other data analysis tools. When data from a variety of sources or categories have been lumped together, the meaning of the data can be impossible to see. This technique separates the data so that patterns can be seen. When to Use Stratification • Before collecting data. • When data come from several sources or conditions, such as shifts, days of the week, suppliers or population",
  "groups. • When data analysis may require separating different sources or conditions. • Stratification Procedure • Before collecting data, consider which information about the sources of the data might have an effect on the results. Set up the data collection so that you collect that information as well. • When plotting or graphing the collected data on a scatter diagram, control chart, histogram or other analysis tool, use different marks or",
  "colors to distinguish data from various sources. Data that are distinguished in this way are said to be “stratified.” • Analyze the subsets of stratified data separately. For example, on a scatter diagram where data are stratified into data from source 1 and data from source 2, draw quadrants, count points and determine the critical value only for the data from source 1, then only for the data from source 2. Stratification Example The ZZ-400",
  "manufacturing team drew a scatter diagram to test whether product purity and iron contamination were related, but the plot did not demonstrate a relationship. Then a team member realized that the data came from three different reactors. The team member redr ew the diagram, using a different symbol for each reactor’s data: Now patterns can be seen. The data from reactor 2 and reactor 3 are circled. Even without doing any calculations, it is clear",
  "that for those two reactors, purity decreases as iron increases. However, the data from reactor 1, the solid dots that are not circled, do not show that relationship. Something is different about reactor 1. Stratification Considerations • Here are examples of different sources that might require data to be stratified: o Equipment o Shifts o Departments o Materials o Suppliers o Day of the week o Time of day o Products • Survey data usually",
  "benefit from stratification. • Always consider before collecting data whether stratification might be needed during analysis. Plan to collect stratification information. After the data are collected it might be too late. o On your graph or chart, include a legend that identifies the marks or colors used. Excerpted from Nancy R. Tague’s The Quality Toolbox, Second Edition, ASQ Quality Press, 2004 (Source ASQ website: www.asq.org)"
]